index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-09-30 Sat 18:32 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Dotfiles matter!</title>
<meta name="author" content="anonymous" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" href="https://cdn.jsdelivr.net/npm/water.css@2/out/water.css">
</head>
<body>
<div id="content" class="content">
<h1 class="title">Dotfiles matter!</h1>
<div id="outline-container-orgb9c8cbe" class="outline-2">
<h2 id="orgb9c8cbe">Please stop dumping files in users&rsquo; $HOME directories.</h2>
<div class="outline-text-2" id="text-orgb9c8cbe">
<p>
<a href="#orgee463e7">Skip to TL;DR</a>
</p>
</div>
<div id="outline-container-orgbe5bdc8" class="outline-3">
<h3 id="orgbe5bdc8">We 💙 dotfiles!</h3>
<div class="outline-text-3" id="text-orgbe5bdc8">
<p>
Dotfiles are important. We use them every day for storing configuration for all kinds of applications, knowingly or otherwise.
You know the ones, hidden in your $HOME directory, <code>~/.ssh/</code> for your ssh keys, or <code>~/.Xauthority</code> (whatever the heck that does).
Something you may not know is these are legacy locations for configuration. Please do not copy their behaviour. <b>Your application&rsquo;s
configuration may be the most important thing on a user&rsquo;s machine.</b> There are now standardised locations on major platforms for
applications to store user-specific configuration.
</p>

<p>
Your application should not be dumping random files into an unconfigurable location in the user&rsquo;s home directory.
</p>
</div>
</div>
<div id="outline-container-org0771e70" class="outline-3">
<h3 id="org0771e70">Configuration is important and so is its location.</h3>
<div class="outline-text-3" id="text-org0771e70">
<p>
Your application&rsquo;s configuration is important. A user may want to back it up as an important part of their system, control its permissions,
handle it with a script on their system or just inspect it. They may not want their configuration stored in $HOME, for example:
</p>
<ul class="org-ul">
<li>they&rsquo;re on a machine that isn&rsquo;t under their physical control and <code>~/.config</code> is mounted over the network from their personal machine;</li>
<li>an automated script they run backs up their <code>~/permanent/configuration</code> directory every night as their OS is stored on a RAMdisk every boot;</li>
<li>they prefer to version control their configuration files using git, with a configuration directory managed over different branches;</li>
<li>the user simply wants to have a clean and consistent $HOME directory and filesystem.</li>
</ul>

<p>
When you hardcode your application&rsquo;s configuration and data directory as <code>~/.my_application</code>, you are contributing to a trend that leaves
people&rsquo;s machines less secure, less consistent, and ultimately less productive.
</p>
</div>
</div>
<div id="outline-container-org4e0c7cd" class="outline-3">
<h3 id="org4e0c7cd">There are libraries to help!</h3>
<div class="outline-text-3" id="text-org4e0c7cd">
<p>
Here are a few in no particular order (YMMV):
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">Go</td>
<td class="org-left"><a href="https://github.com/adrg/xdg">https://github.com/adrg/xdg</a></td>
</tr>

<tr>
<td class="org-left">Rust</td>
<td class="org-left"><a href="https://github.com/dirs-dev/directories-rs">https://github.com/dirs-dev/directories-rs</a>, <a href="https://github.com/whitequark/rust-xdg">https://github.com/whitequark/rust-xdg</a></td>
</tr>

<tr>
<td class="org-left">Python</td>
<td class="org-left"><a href="https://github.com/srstevenson/xdg-base-dirs">https://github.com/srstevenson/xdg-base-dirs</a></td>
</tr>

<tr>
<td class="org-left">Haskell</td>
<td class="org-left"><a href="https://github.com/willdonnelly/xdg-basedir">https://github.com/willdonnelly/xdg-basedir</a></td>
</tr>

<tr>
<td class="org-left">JavaScript</td>
<td class="org-left"><a href="https://github.com/folder/xdg">https://github.com/folder/xdg</a></td>
</tr>

<tr>
<td class="org-left">Java</td>
<td class="org-left"><a href="https://github.com/dirs-dev/directories-jvm">https://github.com/dirs-dev/directories-jvm</a></td>
</tr>

<tr>
<td class="org-left">Clojure</td>
<td class="org-left"><a href="https://github.com/babashka/fs">https://github.com/babashka/fs</a></td>
</tr>

<tr>
<td class="org-left">Ruby</td>
<td class="org-left"><a href="https://github.com/rubyworks/xdg">https://github.com/rubyworks/xdg</a></td>
</tr>

<tr>
<td class="org-left">C++</td>
<td class="org-left"><a href="https://github.com/azubieta/xdg-utils-cxx">https://github.com/azubieta/xdg-utils-cxx</a></td>
</tr>

<tr>
<td class="org-left">Perl</td>
<td class="org-left"><a href="https://metacpan.org/pod/File::BaseDir">https://metacpan.org/pod/File::BaseDir</a></td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-orgee463e7" class="outline-3">
<h3 id="orgee463e7">TL;DR: Where should you store application data?</h3>
<div class="outline-text-3" id="text-orgee463e7">
</div>
<div id="outline-container-orgc5c64d3" class="outline-4">
<h4 id="orgc5c64d3">Linux/Unix</h4>
<div class="outline-text-4" id="text-orgc5c64d3">
<p>
As of 2023, most major Linux distributions and desktop environments adhere to the <a href="https://specifications.freedesktop.org/basedir-spec/basedir-spec-latest.html">XDG Base Directory Specification</a>, which defines standard
locations for different types of files: cache, configuration data, and state (&#x2026; more data). The specification defines environment variables
which if defined provide an absolute path for that kind of data. Following are the expected locations for application files in order of
importance (each path begins from $HOME):
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">Cache</td>
<td class="org-left">$XDG_CACHE_HOME</td>
<td class="org-left">$HOME/.cache</td>
<td class="org-left">Non-essential non-persistent data files, logs, thumbnails etc.</td>
</tr>

<tr>
<td class="org-left">Configuration</td>
<td class="org-left">$XDG_CONFIG_HOME</td>
<td class="org-left">$HOME/.config</td>
<td class="org-left">Persistent configuration data files</td>
</tr>

<tr>
<td class="org-left">Application Data</td>
<td class="org-left">$XDG_DATA_HOME</td>
<td class="org-left">$HOME/.local/share</td>
<td class="org-left">Data files like history, databases, logs, &ldquo;stuff&rdquo;</td>
</tr>

<tr>
<td class="org-left">Executable Files</td>
<td class="org-left">n/a (sigh)</td>
<td class="org-left">$HOME/.local/bin</td>
<td class="org-left">User-facing executable files (i.e. the output of `cc -o &lt;file&gt;`)</td>
</tr>

<tr>
<td class="org-left">Runtime Data</td>
<td class="org-left">$XDG_RUNTIME_DIR</td>
<td class="org-left">Should be provided by your system</td>
<td class="org-left">This is for runtime data (sockets, pipes, whatever.)</td>
</tr>
</tbody>
</table>

<p>
There are more directories, but don&rsquo;t overcomplicate things. Even just using <code>$XDG_CACHE_HOME</code> and <code>$XDG_CONFIG_HOME</code> is a lifesaver.
</p>
</div>
</div>
<div id="outline-container-orga86b6f7" class="outline-4">
<h4 id="orga86b6f7">MacOS</h4>
<div class="outline-text-4" id="text-orga86b6f7">
<p>
Apple provides the <a href="https://developer.apple.com/library/archive/documentation/FileManagement/Conceptual/FileSystemProgrammingGuide/FileSystemOverview/FileSystemOverview.html#//apple_ref/doc/uid/TP40010672-CH2-SW1">File System Programming Guide</a>, which defines expected storage locations, again for: cache, configuration and state (data).
Following are the expected locations for application files (where ~ is $HOME, the current user&rsquo;s home directory):
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">Cache</td>
<td class="org-left">~/Library/Caches</td>
<td class="org-left">Non-essential, non-persistent application data</td>
</tr>

<tr>
<td class="org-left">Application Data, Configuration</td>
<td class="org-left">~/Library/Application Support</td>
<td class="org-left">Persistent configuration data files and &ldquo;private&rdquo; application data</td>
</tr>

<tr>
<td class="org-left">Applications</td>
<td class="org-left">~/Applications</td>
<td class="org-left">Applications</td>
</tr>
</tbody>
</table>

<p>
When writing a cross-platform application, <a href="https://lobste.rs/s/dpmfrd/dotfiles_matter#c_n7myll">some developers like to enable XDG support on Darwin, too (see Linux/Unix section)</a>.
</p>
</div>
</div>
</div>
<div id="outline-container-org69de789" class="outline-3">
<h3 id="org69de789">Please share the word.</h3>
<div class="outline-text-3" id="text-org69de789">
<p>
Users matter. Please help the movement to clean up users&rsquo; $HOME directories and standardise configuration by spreading the word, opening issues
(preferably with PRs, not to annoy maintainers!), and contributing to a world where application data can roam freely in the nature preserve of specification.
</p>
</div>
</div>
<div id="outline-container-org97c48ab" class="outline-3">
<h3 id="org97c48ab">Contact</h3>
<div class="outline-text-3" id="text-org97c48ab">
<p>
If you have opinions or corrections please share them with me at <code>offsetcyan &lt;at&gt; proton.me</code>. Thanks!
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: anonymous</p>
<p class="date">Created: 2023-09-30 Sat 18:32</p>
</div>
</body>
</html>